# AULA 02: CRIANDO DATAFRAMES

In [2]:
import pandas as pd
import numpy as np

Descrição:

Dados tabulares bidimensionais, mutáveis em tamanho, potencialmente heterogêneos. 
A estrutura de dados também contém eixos rotulados (linhas e colunas). As operações aritméticas se alinham em ambos os rótulos de linha e coluna. Pode ser considerado como um contêiner semelhante a um dicionário para objetos Series. A principal estrutura de dados do Pandas.

Parâmetros:
columns = Posso renomear o nome de uma coluna
index = Posso renomear o nome de uma linha

<h2> EXEMPLOS </h2>

In [3]:
d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
pd.DataFrame(data=d, index=[0, 1, 2, 3])

   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

In [4]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
display(df)

   col1  col2
0     1     3
1     2     4

In [8]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])
display (df2)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
notas_alunos = {
    "Maria" : [4,6,8,7],
    "Lucas" : [5,3,4,9],
    "Júlia" : [6,8,6,2],
    "João" :  [5,5,6,2]
}

notasAlunos_DataFrame = pd.DataFrame(data=notas_alunos)
display(notasAlunos_DataFrame)

   Maria  Lucas  Júlia  João
0      4      5      6     5
1      6      3      8     5
2      8      4      6     6
3      7      9      2     2

In [15]:
notas_alunos_2 = np.array([[4,6,8,7],[5,3,4,9],
                      [6,8,6,2], [5,5,6,2]])
notasAlunos2_DataFrame = pd.DataFrame(data=notas_alunos_2, columns= ["Maria", "Lucas","Júlia", "João"])
display(notasAlunos2_DataFrame)

   Maria  Lucas  Júlia  João
0      4      6      8     7
1      5      3      4     9
2      6      8      6     2
3      5      5      6     2